{
    "name": "George Spence",
    "contact": {
        "email": "spence.jobs@pm.me",
        "linkedin": "https://www.linkedin.com/in/george-spence/",
        "linkedin_display": "linkedin.com/in/george-spence",
        "github": "https://github.com/gpspence",
        "github_display": "github.com/george-spence",
        "location": "UK"
    },
    "summary": "George Spence - Data Engineer @ Hexegic | MChem(Hons)",
    "base_url": "None",
    "work_experience": [
        {
            "company": "Hexegic",
            "positions": [
                {
                    "role": "Data Engineer",
                    "skills": [],
                    "start_date": "August 2024",
                    "end_date": "Present"
                }
            ],
            "experiences": [
                "Automated large-scale data ingestion pipelines using PySpark on Palantir Foundry, processing 100+ GB of structured and semi-structured data daily.",
                "Promoted to sub-team lead after 6 months for delivering high-impact data-engineering solutions; mentor junior engineers and lead code reviews to ensure best practices and maintain quality and consistency.",
                "Built a custom Python ETL library to standardise ingestion of 15+ disparate data sources, with support for schema variation, config versioning, and custom data health checks.",
                "Led recovery of a failing project ahead of contract review, resolving frontend and ontology issues and restoring stakeholder confidence.",
                "Modelled complex relational ontologies to represent real-world data relationships and enable cross-domain analytics.",
                "Developed responsive operational dashboards using TypeScript within Palantir Foundry, delivering real-time insights for decision-making."
            ]
        },
        {
            "company": "Defence Science and Technology Laboratories - MOD",
            "positions": [
                {
                    "role": "Scientist (Promoted to Senior Scientist)",
                    "skills": [],
                    "start_date": "June 2022",
                    "end_date": "July 2024"
                }
            ],
            "experiences": [
                "Developed data acquisition and HMI/SCADA systems in DAQFactory, leveraging Python (Pandas, Matplotlib) to characterise chemical sensors for UK MOD procurement.",
                "Managed an international collaboration with a US research lab to evaluate chemical sensor performance for UK MOD procurement.",
                "Supported robotics and autonomy research, including data analysis for large scale trials, presenting at workshops, and drafting funding proposals.",
                "Delivered technical training to stakeholders, simplifying complex topics for diverse audiences."
            ]
        },
        {
            "company": "Charles River Laboratories",
            "positions": [
                {
                    "role": "Technical Assistant",
                    "skills": [],
                    "start_date": "July 2019",
                    "end_date": "June 2020"
                }
            ],
            "experiences": [
                "Conducted chemical synthesis and analysis (HPLC, NMR) for pharmaceutical research projects, directly contributing to a 50-fold increase in biochemical potency of a novel antibiotic drug candidate."
            ]
        }
    ],
    "projects": [
        {
            "name": "Recipe Manager (Full-Stack App)",
            "points": [
                "Built a full-stack meal planner application with a React (Vite) frontend and a Supabase/ PostgreSQL backend, featuring full CRUD, authentication and API-driven state management.",
                "Demonstrated skills: React, TypeScript, SQL, REST APIs, Vercel, Supabase."
            ]
        }
    ],
    "education": {
        "degree": "MChem(Hons) Chemistry with Industrial Placement",
        "degree_result": "First Class Honours",
        "university": "University of Bath",
        "degree_start_date": 2017,
        "degree_end_date": 2021,
        "alevels": [
            "Biology A*",
            "Chemistry A",
            "Maths A"
        ],
        "gcses": "9A*s, 2As"
    }
}